case/constant/LIB/batteryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      batteryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
state		discharge;
C		3.6;//Ah
ISOC		100;
R		R [1 2 -3 0 0 -2 0]		0.3;
I		I [0 0 0 0 0 1 0]		7.2;
dEdT		dEdT [1 2 -3 -1 0 -1 0]		4e-4;
// ************************************************************************* //
