case/constant/PCM/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            PCM;

nu		nu [0 2 -1 0 0 0 0]	1.08e-5;
rho		rho [1 -3 0 0 0 0 0]	842;
Cp		Cp [0 2 -2 -1 0 0 0]	1757;
Pr		Pr [0 0 0 0 0 0 0]	21.87;
Prt		Prt [0 0 0 0 0 0 0]	0.85;
beta            beta [0 0 0 -1 0 0 0]	2.2e-3;
TRef            TRef [0 0 0 1 0 0 0]	308;
hm		hm [0 2 -2 0 0 0 0]	237000.0;
Tm		Tm [0 0 0 1 0 0 0]	316.0;//43C
Tmr		Tmr [0 0 0 1 0 0 0]	3.0;
Cu		Cu [1 -3 -1 0 0 0 0]	1.0e5;
b		b [0 0 0 0 0 0 0]	1.0e-3;
// ************************************************************************* //
