case/system/metalCover/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 308;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            outerWall
            {
                /*type            fixedValue;
                value           uniform 320;*/
                type            zeroGradient;
            }

            metalCover_to_PCM
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName PCM;
                neighbourPatchName PCM_to_metalCover;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 308;
            }
        }
    }

    rho
    {
        internalField   uniform 2640;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            outerWall
            {
                type            zeroGradient;
            }

            metalCover_to_PCM
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 108;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            outerWall
            {
                type            zeroGradient;
            }

            metalCover_to_PCM
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 960;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            outerWall
            {
                type            zeroGradient;
            }

            metalCover_to_PCM
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
